Merge pull request #130 from dock108/data_collect_resort
Data collect re-sort
